In [10]:
import pandas as pd

s = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
clipped_s = s.clip(4, 7)
clipped_s

0    4
1    4
2    4
3    4
4    5
5    6
6    7
7    7
8    7
9    7
dtype: int64

In [11]:
df = pd.DataFrame({
    'A': [10, 20, 30, 40, 50],
    'B': [5, 15, 25, 35, 45]
})
df

    A   B
0  10   5
1  20  15
2  30  25
3  40  35
4  50  45

In [12]:
clipped_df = df.clip(15, 40)
clipped_df

    A   B
0  15  15
1  20  15
2  30  25
3  40  35
4  40  40

In [13]:
df = pd.DataFrame({
    'A': [10, 20, 30, 40, 50],
    'B': [5, 15, 25, 35, 45]
})
df

    A   B
0  10   5
1  20  15
2  30  25
3  40  35
4  50  45

In [25]:
df = pd.DataFrame({
    'A': [10, 20, 30, 40, 50],
    'B': [1, 15, 25, 35, 75]
})

In [26]:
df

    A   B
0  10   1
1  20  15
2  30  25
3  40  35
4  50  75

In [27]:


clipped_df = df.clip(lower=pd.Series([1, 2], index=['A', 'B']), 
                     upper=pd.Series([10, 30], index=['A', 'B']), 
                     axis = 1)
clipped_df

    A   B
0  10   2
1  10  15
2  10  25
3  10  30
4  10  30

In [29]:

clipped_df = df.clip(lower=pd.Series([1, 2], index=['0', '1']), 
                     upper=pd.Series([10, 30], index=['0', '1']), 
                     axis = 0)
clipped_df

    A   B
0 NaN NaN
1 NaN NaN
2 NaN NaN
3 NaN NaN
4 NaN NaN

In [19]:
df = pd.DataFrame({
    'A': [10, 20, 30, 40, 50],
    'B': [5, 15, 25, 35, 45]
})

clipped_df = df.clip(lower=pd.Series([15, 10], index=['A', 'B']), upper=pd.Series([35, 40], index=['A', 'B']), axis = 0)
clipped_df

    A   B
0 NaN NaN
1 NaN NaN
2 NaN NaN
3 NaN NaN
4 NaN NaN

In [16]:
s = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
clipped_s = s.clip(upper=7)
clipped_s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    7
8    7
9    7
dtype: int64